DATA = {
    "512": {
        "name": "忧郁南瓜头 挑战1"
    },
    "513": {
        "name": "忧郁南瓜头 挑战2"
    },
    "514": {
        "name": "忧郁南瓜头 挑战3"
    },
    "515": {
        "name": "魅惑毁灭菇 挑战1"
    },
    "516": {
        "name": "魅惑毁灭菇 挑战2"
    },
    "517": {
        "name": "魅惑毁灭菇 挑战3"
    },
    "518": {
        "name": "魅惑毁灭菇 挑战4"
    },
    "519": {
        "name": "魅惑毁灭菇 挑战5"
    },
    "520": {
        "name": "魅惑毁灭菇 挑战6"
    },
    "521": {
        "name": "西瓜猫蒲 挑战1"
    },
    "522": {
        "name": "西瓜猫蒲 挑战2"
    },
    "523": {
        "name": "西瓜猫蒲 挑战3"
    },
    "524": {
        "name": "高冰果 挑战1"
    },
    "525": {
        "name": "高冰果 挑战2"
    },
    "526": {
        "name": "高冰果 挑战3"
    },
    "527": {
        "name": "汉堡王 挑战1"
    },
    "528": {
        "name": "汉堡王 挑战2"
    },
    "529": {
        "name": "汉堡王 挑战3"
    },
    "530": {
        "name": "豌豆炮 挑战1"
    },
    "531": {
        "name": "豌豆炮 挑战2"
    },
    "532": {
        "name": "豌豆炮 挑战3"
    },
    "533": {
        "name": "热狗射手 挑战1"
    },
    "534": {
        "name": "热狗射手 挑战2"
    },
    "535": {
        "name": "热狗射手 挑战3"
    },
    "536": {
        "name": "黄油忧郁菇 挑战1"
    },
    "537": {
        "name": "黄油忧郁菇 挑战2"
    },
    "538": {
        "name": "黄油忧郁菇 挑战3"
    },
    "539": {
        "name": "刚刺坚果王 挑战1"
    },
    "540": {
        "name": "刚刺坚果王 挑战2"
    },
    "541": {
        "name": "刚刺坚果王 挑战3"
    },
    "542": {
        "name": "毁灭加农炮 挑战1"
    },
    "543": {
        "name": "毁灭加农炮 挑战2"
    },
    "544": {
        "name": "毁灭加农炮 挑战3"
    },
    "545": {
        "name": "向日葵女王 挑战1"
    },
    "546": {
        "name": "向日葵女王 挑战2"
    },
    "547": {
        "name": "向日葵女王 挑战3"
    },
    "548": {
        "name": "至尊VIP坚果 挑战1"
    },
    "549": {
        "name": "至尊VIP坚果 挑战2"
    },
    "550": {
        "name": "至尊VIP坚果 挑战3"
    },
    "551": {
        "name": "丘比特魅惑菇 挑战1"
    },
    "552": {
        "name": "丘比特魅惑菇 挑战2"
    },
    "553": {
        "name": "丘比特魅惑菇 挑战3"
    },
    "554": {
        "name": "丘比特魅惑菇 挑战4"
    },
    "555": {
        "name": "丘比特魅惑菇 挑战5"
    },
    "556": {
        "name": "丘比特魅惑菇 挑战6"
    },
    "557": {
        "name": "财神金盏花 挑战1"
    },
    "558": {
        "name": "财神金盏花 挑战2"
    },
    "559": {
        "name": "财神金盏花 挑战3"
    },
    "560": {
        "name": "财神金盏花 挑战4"
    },
    "561": {
        "name": "财神金盏花 挑战5"
    },
    "562": {
        "name": "财神金盏花 挑战6"
    },
    "563": {
        "name": "精灵菇 挑战1"
    },
    "564": {
        "name": "精灵菇 挑战2"
    },
    "565": {
        "name": "精灵菇 挑战3"
    },
    "566": {
        "name": "精灵菇 挑战4"
    },
    "567": {
        "name": "精灵菇 挑战5"
    },
    "568": {
        "name": "精灵菇 挑战6"
    },
    "569": {
        "name": "头脑风暴 挑战1"
    },
    "570": {
        "name": "头脑风暴 挑战2"
    },
    "571": {
        "name": "头脑风暴 挑战3"
    },
    "572": {
        "name": "头脑风暴 挑战4"
    },
    "573": {
        "name": "头脑风暴 挑战5"
    },
    "574": {
        "name": "头脑风暴 挑战6"
    },
    "575": {
        "name": "宝藏吞噬者 挑战1"
    },
    "576": {
        "name": "宝藏吞噬者 挑战2"
    },
    "577": {
        "name": "宝藏吞噬者 挑战3"
    },
    "578": {
        "name": "宝藏吞噬者 挑战4"
    },
    "579": {
        "name": "宝藏吞噬者 挑战5"
    },
    "580": {
        "name": "宝藏吞噬者 挑战6"
    },
    "581": {
        "name": "全息卡牌投影 挑战1"
    },
    "582": {
        "name": "全息卡牌投影 挑战2"
    },
    "583": {
        "name": "全息卡牌投影 挑战3"
    },
    "584": {
        "name": "全息卡牌投影 挑战4"
    },
    "585": {
        "name": "全息卡牌投影 挑战5"
    },
    "586": {
        "name": "全息卡牌投影 挑战6"
    },
    "587": {
        "name": "冰瓜香蒲 挑战1"
    },
    "588": {
        "name": "冰瓜香蒲 挑战2"
    },
    "589": {
        "name": "冰瓜香蒲 挑战3"
    },
    "590": {
        "name": "狂野机枪射手 挑战1"
    },
    "591": {
        "name": "狂野机枪射手 挑战2"
    },
    "592": {
        "name": "狂野机枪射手 挑战3"
    },
    "593": {
        "name": "生命重塑者 挑战1"
    },
    "594": {
        "name": "生命重塑者 挑战2"
    },
    "595": {
        "name": "生命重塑者 挑战3"
    },
    "596": {
        "name": "生命重塑者 挑战4"
    },
    "597": {
        "name": "生命重塑者 挑战5"
    },
    "598": {
        "name": "生命重塑者 挑战6"
    },
    "599": {
        "name": "惩戒牢笼 挑战1"
    },
    "600": {
        "name": "惩戒牢笼 挑战2"
    },
    "601": {
        "name": "惩戒牢笼 挑战3"
    },
    "602": {
        "name": "惩戒牢笼 挑战4"
    },
    "603": {
        "name": "惩戒牢笼 挑战5"
    },
    "604": {
        "name": "惩戒牢笼 挑战6"
    },
    "605": {
        "name": "消消乐糖果 挑战1"
    },
    "606": {
        "name": "消消乐糖果 挑战2"
    },
    "607": {
        "name": "消消乐糖果 挑战3"
    },
    "608": {
        "name": "消消乐糖果 挑战4"
    },
    "609": {
        "name": "消消乐糖果 挑战5"
    },
    "610": {
        "name": "消消乐糖果 挑战6"
    },
    "768": {
        "name": "无尽模式：白天"
    },
    "769": {
        "name": "无尽模式：夜晚"
    },
    "770": {
        "name": "无尽模式：泳池"
    },
    "771": {
        "name": "无尽模式：浓雾"
    },
    "772": {
        "name": "无尽模式：夜晚裸地"
    },
    "773": {
        "name": "无尽模式：反转泳池"
    },
    "774": {
        "name": "无尽模式：山谷泳池"
    },
    "775": {
        "name": "无尽模式：白天裸地"
    },
    "776": {
        "name": "无尽模式：月夜池塘"
    },
    "777": {
        "name": "无尽模式：丛林"
    },
    "778": {
        "name": "无尽模式：三分天下"
    },
    "779": {
        "name": "无尽模式：平面屋顶"
    },
    "780": {
        "name": "无尽模式：金银岛"
    },
    "781": {
        "name": "无尽模式：四海"
    },
    "782": {
        "name": "戴夫博士的无尽复仇"
    },
    "783": {
        "name": "无尽的幸运"
    },
    "784": {
        "name": "抽奖盒子 无尽版"
    },
    "785": {
        "name": "无尽模式：鬼灵村庄"
    },
    "786": {
        "name": "无尽模式：金银港"
    },
    "787": {
        "name": "无尽模式：全泳池"
    },
    "788": {
        "name": "无尽模式：深夜池塘"
    },
    "789": {
        "name": "无尽模式：种子雨"
    },
    "790": {
        "name": "无尽模式：传送带"
    },
    "791": {
        "name": "无尽的物资"
    },
    "792": {
        "name": "每天都是月末"
    },
    "793": {
        "name": "抽奖盒子泳池版"
    },
    "794": {
        "name": "无尽的宝藏"
    }
}