DATA = {
    "512": {
        "name": "挑战模式 忧郁南瓜头 挑战1"
    },
    "513": {
        "name": "挑战模式 忧郁南瓜头 挑战2"
    },
    "514": {
        "name": "挑战模式 忧郁南瓜头 挑战3"
    },

    "515": {
        "name": "挑战模式 魅惑毁灭菇 挑战1"
    },
    "516": {
        "name": "挑战模式 魅惑毁灭菇 挑战2"
    },
    "517": {
        "name": "挑战模式 魅惑毁灭菇 挑战3"
    },
    "518": {
        "name": "挑战模式 魅惑毁灭菇 挑战4"
    },
    "519": {
        "name": "挑战模式 魅惑毁灭菇 挑战5"
    },
    "520": {
        "name": "挑战模式 魅惑毁灭菇 挑战6"
    },

    "521": {
        "name": "挑战模式 西瓜猫蒲 挑战1"
    },
    "522": {
        "name": "挑战模式 西瓜猫蒲 挑战2"
    },
    "523": {
        "name": "挑战模式 西瓜猫蒲 挑战3"
    },

    "524": {
        "name": "挑战模式 高冰果 挑战1"
    },
    "525": {
        "name": "挑战模式 高冰果 挑战2"
    },
    "526": {
        "name": "挑战模式 高冰果 挑战3"
    },

    "527": {
        "name": "挑战模式 汉堡王 挑战1"
    },
    "528": {
        "name": "挑战模式 汉堡王 挑战2"
    },
    "529": {
        "name": "挑战模式 汉堡王 挑战3"
    },

    "530": {
        "name": "挑战模式 豌豆炮 挑战1"
    },
    "531": {
        "name": "挑战模式 豌豆炮 挑战2"
    },
    "532": {
        "name": "挑战模式 豌豆炮 挑战3"
    },

    "533": {
        "name": "挑战模式 热狗射手 挑战1"
    },
    "534": {
        "name": "挑战模式 热狗射手 挑战2"
    },
    "535": {
        "name": "挑战模式 热狗射手 挑战3"
    },

    "536": {
        "name": "挑战模式 黄油忧郁菇 挑战1"
    },
    "537": {
        "name": "挑战模式 黄油忧郁菇 挑战2"
    },
    "538": {
        "name": "挑战模式 黄油忧郁菇 挑战3"
    },

    "539": {
        "name": "挑战模式 刚刺坚果王 挑战1"
    },
    "540": {
        "name": "挑战模式 刚刺坚果王 挑战2"
    },
    "541": {
        "name": "挑战模式 刚刺坚果王 挑战3"
    },

    "542": {
        "name": "挑战模式 毁灭加农炮 挑战1"
    },
    "543": {
        "name": "挑战模式 毁灭加农炮 挑战2"
    },
    "544": {
        "name": "挑战模式 毁灭加农炮 挑战3"
    },

    "545": {
        "name": "挑战模式 向日葵女王 挑战1"
    },
    "546": {
        "name": "挑战模式 向日葵女王 挑战2"
    },
    "547": {
        "name": "挑战模式 向日葵女王 挑战3"
    },

    "548": {
        "name": "挑战模式 至尊VIP坚果 挑战1"
    },
    "549": {
        "name": "挑战模式 至尊VIP坚果 挑战2"
    },
    "550": {
        "name": "挑战模式 至尊VIP坚果 挑战3"
    },

    "551": {
        "name": "挑战模式 丘比特魅惑菇 挑战1"
    },
    "552": {
        "name": "挑战模式 丘比特魅惑菇 挑战2"
    },
    "553": {
        "name": "挑战模式 丘比特魅惑菇 挑战3"
    },
    "554": {
        "name": "挑战模式 丘比特魅惑菇 挑战4"
    },
    "555": {
        "name": "挑战模式 丘比特魅惑菇 挑战5"
    },
    "556": {
        "name": "挑战模式 丘比特魅惑菇 挑战6"
    },

    "557": {
        "name": "挑战模式 财神金盏花 挑战1"
    },
    "558": {
        "name": "挑战模式 财神金盏花 挑战2"
    },
    "559": {
        "name": "挑战模式 财神金盏花 挑战3"
    },
    "560": {
        "name": "挑战模式 财神金盏花 挑战4"
    },
    "561": {
        "name": "挑战模式 财神金盏花 挑战5"
    },
    "562": {
        "name": "挑战模式 财神金盏花 挑战6"
    },

    "563": {
        "name": "挑战模式 精灵菇 挑战1"
    },
    "564": {
        "name": "挑战模式 精灵菇 挑战2"
    },
    "565": {
        "name": "挑战模式 精灵菇 挑战3"
    },
    "566": {
        "name": "挑战模式 精灵菇 挑战4"
    },
    "567": {
        "name": "挑战模式 精灵菇 挑战5"
    },
    "568": {
        "name": "挑战模式 精灵菇 挑战6"
    },

    "569": {
        "name": "挑战模式 头脑风暴 挑战1"
    },
    "570": {
        "name": "挑战模式 头脑风暴 挑战2"
    },
    "571": {
        "name": "挑战模式 头脑风暴 挑战3"
    },
    "572": {
        "name": "挑战模式 头脑风暴 挑战4"
    },
    "573": {
        "name": "挑战模式 头脑风暴 挑战5"
    },
    "574": {
        "name": "挑战模式 头脑风暴 挑战6"
    },

    "575": {
        "name": "挑战模式 宝藏吞噬者 挑战1"
    },
    "576": {
        "name": "挑战模式 宝藏吞噬者 挑战2"
    },
    "577": {
        "name": "挑战模式 宝藏吞噬者 挑战3"
    },
    "578": {
        "name": "挑战模式 宝藏吞噬者 挑战4"
    },
    "579": {
        "name": "挑战模式 宝藏吞噬者 挑战5"
    },
    "580": {
        "name": "挑战模式 宝藏吞噬者 挑战6"
    },

    "581": {
        "name": "挑战模式 全息卡牌投影 挑战1"
    },
    "582": {
        "name": "挑战模式 全息卡牌投影 挑战2"
    },
    "583": {
        "name": "挑战模式 全息卡牌投影 挑战3"
    },
    "584": {
        "name": "挑战模式 全息卡牌投影 挑战4"
    },
    "585": {
        "name": "挑战模式 全息卡牌投影 挑战5"
    },
    "586": {
        "name": "挑战模式 全息卡牌投影 挑战6"
    },

    "587": {
        "name": "挑战模式 冰瓜香蒲 挑战1"
    },
    "588": {
        "name": "挑战模式 冰瓜香蒲 挑战2"
    },
    "589": {
        "name": "挑战模式 冰瓜香蒲 挑战3"
    },

    "590": {
        "name": "挑战模式 狂野机枪射手 挑战1"
    },
    "591": {
        "name": "挑战模式 狂野机枪射手 挑战2"
    },
    "592": {
        "name": "挑战模式 狂野机枪射手 挑战3"
    },

    "593": {
        "name": "挑战模式 生命重塑者 挑战1"
    },
    "594": {
        "name": "挑战模式 生命重塑者 挑战2"
    },
    "595": {
        "name": "挑战模式 生命重塑者 挑战3"
    },
    "596": {
        "name": "挑战模式 生命重塑者 挑战4"
    },
    "597": {
        "name": "挑战模式 生命重塑者 挑战5"
    },
    "598": {
        "name": "挑战模式 生命重塑者 挑战6"
    },

    "599": {
        "name": "挑战模式 惩戒牢笼 挑战1"
    },
    "600": {
        "name": "挑战模式 惩戒牢笼 挑战2"
    },
    "601": {
        "name": "挑战模式 惩戒牢笼 挑战3"
    },
    "602": {
        "name": "挑战模式 惩戒牢笼 挑战4"
    },
    "603": {
        "name": "挑战模式 惩戒牢笼 挑战5"
    },
    "604": {
        "name": "挑战模式 惩戒牢笼 挑战6"
    },

    "605": {
        "name": "挑战模式 消消乐糖果 挑战1"
    },
    "606": {
        "name": "挑战模式 消消乐糖果 挑战2"
    },
    "607": {
        "name": "挑战模式 消消乐糖果 挑战3"
    },
    "608": {
        "name": "挑战模式 消消乐糖果 挑战4"
    },
    "609": {
        "name": "挑战模式 消消乐糖果 挑战5"
    },
    "610": {
        "name": "挑战模式 消消乐糖果 挑战6"
    },

    "611": {
        "name": "挑战模式 寒冰加农炮 挑战1"
    },
    "612": {
        "name": "挑战模式 寒冰加农炮 挑战2"
    },
    "613": {
        "name": "挑战模式 寒冰加农炮 挑战3"
    },

    "614": {
        "name": "挑战模式 黄金西瓜投手 挑战1"
    },
    "615": {
        "name": "挑战模式 黄金西瓜投手 挑战2"
    },
    "616": {
        "name": "挑战模式 黄金西瓜投手 挑战3"
    },

    "617": {
        "name": "挑战模式 寒冰菇王 挑战1"
    },
    "618": {
        "name": "挑战模式 寒冰菇王 挑战2"
    },
    "619": {
        "name": "挑战模式 寒冰菇王 挑战3"
    },
    "620": {
        "name": "挑战模式 寒冰菇王 挑战4"
    },
    "621": {
        "name": "挑战模式 寒冰菇王 挑战5"
    },
    "622": {
        "name": "挑战模式 寒冰菇王 挑战6"
    },

    "623": {
        "name": "挑战模式 辣椒重塑者 挑战1"
    },
    "624": {
        "name": "挑战模式 辣椒重塑者 挑战2"
    },
    "625": {
        "name": "挑战模式 辣椒重塑者 挑战3"
    },
    "626": {
        "name": "挑战模式 辣椒重塑者 挑战4"
    },
    "627": {
        "name": "挑战模式 辣椒重塑者 挑战5"
    },
    "628": {
        "name": "挑战模式 辣椒重塑者 挑战6"
    },

    "629": {
        "name": "挑战模式 棱镜向日葵 挑战1"
    },
    "630": {
        "name": "挑战模式 棱镜向日葵 挑战2"
    },
    "631": {
        "name": "挑战模式 棱镜向日葵 挑战3"
    },
    "632": {
        "name": "挑战模式 棱镜向日葵 挑战4"
    },
    "633": {
        "name": "挑战模式 棱镜向日葵 挑战5"
    },
    "634": {
        "name": "挑战模式 棱镜向日葵 挑战6"
    },

    "635": {
        "name": "挑战模式 大王钢齿花 挑战1"
    },
    "636": {
        "name": "挑战模式 大王钢齿花 挑战2"
    },
    "637": {
        "name": "挑战模式 大王钢齿花 挑战3"
    },

    "638": {
        "name": "挑战模式 天使向日葵 挑战1"
    },
    "639": {
        "name": "挑战模式 天使向日葵 挑战2"
    },
    "640": {
        "name": "挑战模式 天使向日葵 挑战3"
    },
    "641": {
        "name": "挑战模式 天使向日葵 挑战4"
    },
    "642": {
        "name": "挑战模式 天使向日葵 挑战5"
    },
    "643": {
        "name": "挑战模式 天使向日葵 挑战6"
    },

    # v2.6
    "644": {
        "name": "挑战模式 忧郁咖啡豆 挑战1"
    },
    "645": {
        "name": "挑战模式 忧郁咖啡豆 挑战2"
    },
    "646": {
        "name": "挑战模式 忧郁咖啡豆 挑战3"
    },
    
    "647": {
        "name": "挑战模式 至尊VIP树桩 挑战1"
    },
    "648": {
        "name": "挑战模式 至尊VIP树桩 挑战2"
    },
    "649": {
        "name": "挑战模式 至尊VIP树桩 挑战3"
    },

    "650": {
        "name": "挑战模式 黄金锤子 挑战1"
    },
    "651": {
        "name": "挑战模式 黄金锤子 挑战2"
    },
    "652": {
        "name": "挑战模式 黄金锤子 挑战3"
    },

    "653": {
        "name": "挑战模式 雷果子 挑战1"
    },
    "654": {
        "name": "挑战模式 雷果子 挑战2"
    },
    "655": {
        "name": "挑战模式 雷果子 挑战3"
    },

    "656": {
        "name": "挑战模式 年轮重塑者 挑战1"
    },
    "657": {
        "name": "挑战模式 年轮重塑者 挑战2"
    },
    "658": {
        "name": "挑战模式 年轮重塑者 挑战3"
    },
    "659": {
        "name": "挑战模式 年轮重塑者 挑战4"
    },
    "660": {
        "name": "挑战模式 年轮重塑者 挑战5"
    },
    "661": {
        "name": "挑战模式 年轮重塑者 挑战6"
    },







    "768": {
        "name": "生存模式 无尽模式：白天"
    },
    "769": {
        "name": "生存模式 无尽模式：夜晚"
    },
    "770": {
        "name": "生存模式 无尽模式：泳池"
    },
    "771": {
        "name": "生存模式 无尽模式：浓雾"
    },
    "772": {
        "name": "生存模式 无尽模式：夜晚裸地"
    },
    "773": {
        "name": "生存模式 无尽模式：反转泳池"
    },
    "774": {
        "name": "生存模式 无尽模式：山谷泳池"
    },
    "775": {
        "name": "生存模式 无尽模式：白天裸地"
    },
    "776": {
        "name": "生存模式 无尽模式：月夜池塘"
    },
    "777": {
        "name": "生存模式 无尽模式：丛林"
    },
    "778": {
        "name": "生存模式 无尽模式：三分天下"
    },
    "779": {
        "name": "生存模式 无尽模式：平面屋顶"
    },
    "780": {
        "name": "生存模式 无尽模式：金银岛"
    },
    "781": {
        "name": "生存模式 无尽模式：四海"
    },
    "782": {
        "name": "生存模式 戴夫博士的无尽复仇"
    },
    "783": {
        "name": "生存模式 无尽的幸运"
    },
    "784": {
        "name": "生存模式 抽奖盒子 无尽版"
    },
    "785": {
        "name": "生存模式 无尽模式：鬼灵村庄"
    },
    "786": {
        "name": "生存模式 无尽模式：金银港"
    },
    "787": {
        "name": "生存模式 无尽模式：全泳池"
    },
    "788": {
        "name": "生存模式 无尽模式：深夜池塘"
    },
    "789": {
        "name": "生存模式 无尽模式：种子雨"
    },
    "790": {
        "name": "生存模式 无尽模式：传送带"
    },
    "791": {
        "name": "生存模式 无尽的物资"
    },
    "792": {
        "name": "生存模式 每天都是月末"
    },
    "793": {
        "name": "生存模式 抽奖盒子泳池版"
    },
    "794": {
        "name": "生存模式 无尽的宝藏"
    },
    "795": {
        "name": "生存模式 植物僵尸 无尽版"
    },
    "796": {
        "name": "生存模式 坚果保龄球 无尽版"
    },
    "797": {
        "name": "生存模式 僵尸大战 无尽版"
    },
    "798": {
        "name": "生存模式 柱子 无尽版"
    },
    "799": {
        "name": "生存模式 宝石迷阵 无尽版"
    },
    "800": {
        "name": "生存模式 宝石迷阵 闪电战"
    },
    "801": {
        "name": "生存模式 锤僵尸 无尽版"
    },
    "802": {
        "name": "生存模式 抽奖盒子 自费版"
    },
    "803": {
        "name": "生存模式 无尽的宝藏 2"
    },
    "804": {
        "name": "生存模式 自费盒子BOSS版"
    },


    "2048": {
        "name": "迷你游戏 土星"
    },
    "2049": {
        "name": "迷你游戏 植物僵尸"
    },
    "2050": {
        "name": "迷你游戏 坚果保龄球"
    },
    "2051": {
        "name": "迷你游戏 种子雨"
    },
    "2052": {
        "name": "迷你游戏 老虎机"
    },
    "2053": {
        "name": "迷你游戏 宝石迷阵"
    },
    "2054": {
        "name": "迷你游戏 隐形食脑者"
    },
    "2055": {
        "name": "迷你游戏 小僵尸大麻烦"
    },
    "2056": {
        "name": "迷你游戏 保护传送门"
    },
    "2057": {
        "name": "迷你游戏 你看，他们像柱子一样"
    },
    "2058": {
        "name": "迷你游戏 宝石迷阵 转转看"
    },
    "2059": {
        "name": "迷你游戏 全面冻结"
    },
    "2060": {
        "name": "迷你游戏 僵尸快跑"
    },
    "2061": {
        "name": "迷你游戏 锤僵尸"
    },
    "2062": {
        "name": "迷你游戏 谁笑到最后"
    },
    "2063": {
        "name": "迷你游戏 僵王博士的复仇"
    },
    "2064": {
        "name": "迷你游戏 植物僵尸2"
    },
    "2065": {
        "name": "迷你游戏 坚果保龄球2"
    },
    "2066": {
        "name": "迷你游戏 幸运的一天"
    },
    "2067": {
        "name": "迷你游戏 抽奖盒子"
    },
    "2068": {
        "name": "迷你游戏 挖宝"
    },
    "2069": {
        "name": "迷你游戏 抽卡游戏"
    },
    "2070": {
        "name": "迷你游戏 植物僵尸3"
    },
    "2071": {
        "name": "迷你游戏 坚果保龄球3"
    },
    "2072": {
        "name": "迷你游戏 僵尸乒乓球"
    },
    "2073": {
        "name": "迷你游戏 超级杂交地图"
    },
    "2074": {
        "name": "迷你游戏 冰冻关卡"
    },
    "2075": {
        "name": "迷你游戏 坚果的艺术"
    },
    "2076": {
        "name": "迷你游戏 僵尸大战"
    },
    "2077": {
        "name": "迷你游戏 满屋蒜香"
    },
    "2078": {
        "name": "迷你游戏 舞王派对"
    },
    "2079": {
        "name": "迷你游戏 砸罐子"
    },
    "2080": {
        "name": "迷你游戏 搬花"
    },
    "2081": {
        "name": "迷你游戏 冬眠"
    },
    # v2.6
    "2082": {
        "name": "迷你游戏 植物僵尸4"
    },
    "2083": {
        "name": "迷你游戏 坑坑洼洼"
    },
    "2084": {
        "name": "迷你游戏 蹦极闪电战"
    },
    "2085": {
        "name": "迷你游戏 影子"
    },
    

    "2304": {
        "name": "益智模式 第一个罐子"
    },
    "2305": {
        "name": "益智模式 蒜了吧"
    },
    "2306": {
        "name": "益智模式 无草皮之地"
    },
    "2307": {
        "name": "益智模式 多重防御"
    },
    "2308": {
        "name": "益智模式 豌豆戏水"
    },
    "2309": {
        "name": "益智模式 深夜池塘"
    },
    "2310": {
        "name": "益智模式 换位思考"
    },
    "2311": {
        "name": "益智模式 连锁反应"
    },
    "2312": {
        "name": "益智模式 透视罐子"
    },
    "2313": {
        "name": "益智模式 砸罐子无尽版"
    },
    "2314": {
        "name": "益智模式 我是僵尸"
    },
    "2315": {
        "name": "益智模式 蘑菇园"
    },
    "2316": {
        "name": "益智模式 坚不可摧"
    },
    "2317": {
        "name": "益智模式 不许动"
    },
    "2318": {
        "name": "益智模式 谁是僵尸"
    },
    "2319": {
        "name": "益智模式 吃了它"
    },
    "2320": {
        "name": "益智模式 不知所措"
    },
    "2321": {
        "name": "益智模式 原地爆炸"
    },
    "2322": {
        "name": "益智模式 金银财宝"
    },
    "2323": {
        "name": "益智模式 我是僵尸无尽版"
    },

    # v2.6
    "2324": {
        "name": "益智模式 两面夹击"
    },
    "2325": {
        "name": "益智模式 继续夹击"
    },
    "2326": {
        "name": "益智模式 晨昏线"
    },
    "2327": {
        "name": "益智模式 世界的另一面"
    },
    "2328": {
        "name": "益智模式 与时间赛跑"
    },
    "2329": {
        "name": "益智模式 天亮了"
    },
    "2330": {
        "name": "益智模式 过关斩僵"
    },
    "2331": {
        "name": "益智模式 植物僵尸"
    },
    "2332": {
        "name": "益智模式 膨胀"
    },
    "2333": {
        "name": "益智模式 接着奏乐接着舞"
    },
    "2334": {
        "name": "益智模式 一半一半"
    },
    "2335": {
        "name": "益智模式 阴阳池"
    },
    "2336": {
        "name": "益智模式 昼夜交替"
    },
    "2337": {
        "name": "益智模式 终极战术"
    },
    "2338": {
        "name": "益智模式 冰火两重天"
    },
    "2339": {
        "name": "益智模式 渐入佳境"
    },
    "2340": {
        "name": "益智模式 传送门"
    },
    "2341": {
        "name": "益智模式 翻面"
    },
    "2342": {
        "name": "益智模式 无尽的夹击"
    },
    "2343": {
        "name": "益智模式 无尽的夹击(泳池)"
    },


    # v2.6 英雄模式
    "2560": {
        "name": "英雄模式 英雄登场"
    },
    "2561": {
        "name": "英雄模式 雪地冒险"
    },
    "2562": {
        "name": "英雄模式 乘胜追击"
    },
    "2563": {
        "name": "英雄模式 枪林弹雨"
    },
    "2564": {
        "name": "英雄模式 冰霜巨人"
    },
    "2565": {
        "name": "英雄模式 公主驾到"
    },
    "2566": {
        "name": "英雄模式 再见埃德加"
    },
    "2567": {
        "name": "英雄模式 戴夫的威胁"
    },
    "2568": {
        "name": "英雄模式 埃德加二世"
    },
    "2569": {
        "name": "英雄模式 疯狂星期四"
    },
    "2570": {
        "name": "英雄模式 抽奖盒子"
    },
    "2571": {
        "name": "英雄模式 戴夫博士的阴谋"
    },
    "2572": {
        "name": "英雄模式 谁笑到最后"
    },
    "2573": {
        "name": "英雄模式 狼狈为奸"
    },
    "2574": {
        "name": "英雄模式 终极计划"
    },
    "2575": {
        "name": "英雄模式 全息大脑的秘密"
    },
    "2576": {
        "name": "英雄模式 迷你的行尸走肉"
    },
    "2577": {
        "name": "英雄模式 传送带的研发"
    },
    "2578": {
        "name": "英雄模式 爆炸装置"
    },
    "2579": {
        "name": "英雄模式 埃德加的遗言"
    },

    
}